saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_KExx_DFP.1.8.1.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.9" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_KExx_DFP</name>
  <description>NXP Kinetis KExx Series Device Support</description>

  <releases>
    <release version ="1.8.1" date="2017-11-20" deprecated="2017-11-20">
      Maintenance of this pack is discontinued. NXP is now continuing the support in these packs:
      - NXP.MKE02Z4_DFP, NXP.MKE04Z4_DFP, NXP.MKE04Z1284_DFP, NXP.MKE06Z4_DFP.
      - NXP.MKE14F16_DFP, NXP.MKE14Z7_DFP.
      - NXP.MKE15Z7_DFP.
      - NXP.MKE16F16_DFP.
      - NXP.MKE18F16_DFP.
    </release>
    <release version="1.8.0" date="2017-07-13">
      Updated device support files for:
       - KE02Z4, KE04Z4, KE04Z128, KE06Z4.
      Updated documentation.
    </release>
    <release version="1.7.0" date="2017-02-20">
      Added TWR-KE18F development board support
      - Added RTX5 example
      - Added development board description and documentation
      Updated device header files: added ARM Clang 6 directives for handling anonymous unions
    </release>
    <release version="1.6.0" date="2016-11-17">
    - Updated KE1xZ device support files including documentation.
    </release>
    <release version="1.5.0" date="2016-09-21">
      Reworked KExx_DFP.
      - Changed device vendor to NXP.
      - Renamed subfamily KE1x to KE1xZ according NXP web site.
      - Updated KE1xZ device support files.
      - Updated documentation.
      - Updated boards description.
      - Updated example project files for changed device vendor.
    </release>
    <release version="1.4.0" date="2016-05-23">
      Added device support for KE14F, KE16F, KE18F devices
      Added device support for KE1xZ series
      Updated MKE1x_P256_2KB_SEC Flash Algorithm.
      Updated KE1xZ Flash Algorithm.
      Reworked section Conditions, Startup.
      Updated documentation.
    </release>
    <release version="1.2.1">
      SRAM range correction.
    </release>
    <release version="1.2.0" date="2014-07-29">
      Added Boards FRDM-KE04Z, FRDM-KE06Z.
      Added examples for FRDM-KE06Z.
    </release>
    <release version="1.1.0" date="2014-06-12">
      Updated SVD files
    </release>
    <release version="1.0.0">
      First Release version of KExx Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>KExx</keyword>
  </keywords>

  <devices>
    <family Dfamily="KExx Series" Dvendor="NXP:11">

      <!-- ******************************  KE02  ****************************** -->
      <subFamily DsubFamily="KE02">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
        <description>
The Kinetis KE02 40 MHz MCU family delivers a next-generation solution with enhanced ESD/EMC performance for cost-sensitive, high-reliability device applications used in high electrical noise environments.
 - Offers a cost-effective 32-bit solution featuring low power and high robustness
 - Includes a powerful array of analog, communication and timing, and control peripherals with varying flash memory size and pin count
 - Provides a pin-compatible entry point to the Kinetis E series portfolio, as well as pin compatibility with Our 8-bit S08P family
        </description>

        <!-- ******************************  MKE02Z16xxx2  ****************************** -->
        <device Dname="MKE02Z16xxx2">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
          <compile header="Device/Include/MKE02Z2.h" define="MKE02Z16xxx2"/>
          <debug svd="SVD/MKE02Z2.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFFFE00" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/MKE02Zxxx_P16KB.FLM"  start="0x00000000" size="0x00004000" RAMstart="0x1FFFFE00" RAMsize="0x00000800" default="1"/>
          <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x00000100" RAMstart="0x1FFFFE00" RAMsize="0x00000800" default="1"/>

          <book name="Documents/MKE02Z64M20SF0RM.pdf" title="MKE02Z16xxx2 Device Reference Manual"/>
          <book name="Documents/MKE02P64M20SF0.pdf"   title="MKE02Z16xxx2 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKE02Z32xxx2  ****************************** -->
        <device Dname="MKE02Z32xxx2">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
          <compile header="Device/Include/MKE02Z2.h" define="MKE02Z32xxx2"/>
          <debug svd="SVD/MKE02Z2.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFFFC00" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE02Zxxx_P32KB.FLM"  start="0x00000000" size="0x00008000" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x00000100" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>

          <book name="Documents/MKE02Z64M20SF0RM.pdf" title="MKE02Z32xxx2 Device Reference Manual"/>
          <book name="Documents/MKE02P64M20SF0.pdf"   title="MKE02Z32xxx2 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKE02Z64xxx2  ****************************** -->
        <device Dname="MKE02Z64xxx2">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
          <compile header="Device/Include/MKE02Z2.h" define="MKE02Z64xxx2"/>
          <debug svd="SVD/MKE02Z2.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFFFC00" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE02Zxxx_P64KB.FLM"  start="0x00000000" size="0x00010000" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x00000100" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>

