saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_KExx_DFP.1.8.1.pdsc
        <!-- ******************************  MKE16F512xxx16  ****************************** -->
        <device Dname="MKE16F512xxx16">
          <compile header="Device/Include/MKE16F16.h" define="MKE16F512xxx16"/>
          <debug svd="SVD/MKE16F16.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00010000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFF8000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P512_4KB_SEC.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE1x_D64_2KB_SEC.FLM"  start="0x10000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KE1xFP100M168SF0RM.pdf" title="Kinetis KE1xF Sub-Family Reference Manual"/>
          <book name="Documents/KE1xFP100M168SF0.pdf"   title="Kinetis KE1xF Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKE18F256xxx16  ****************************** -->
        <device Dname="MKE18F256xxx16">
          <compile header="Device/Include/MKE18F16.h" define="MKE18F256xxx16"/>
          <debug svd="SVD/MKE18F16.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00008000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFFC000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P256_4KB_SEC.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE1x_D32_2KB_SEC.FLM"  start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KE1xFP100M168SF0RM.pdf" title="Kinetis KE1xF Sub-Family Reference Manual"/>
          <book name="Documents/KE1xFP100M168SF0.pdf"   title="Kinetis KE1xF Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKE14F512xxx16  ****************************** -->
        <device Dname="MKE18F512xxx16">
          <compile header="Device/Include/MKE18F16.h" define="MKE18F512xxx16"/>
          <debug svd="SVD/MKE18F16.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IROM2"                             start="0x10000000" size="0x00010000" startup="0" default="0"/>
          <memory id="IRAM1"                             start="0x1FFF8000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/MKE1x_P512_4KB_SEC.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
          <algorithm name="Flash/MKE1x_D64_2KB_SEC.FLM"  start="0x10000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KE1xFP100M168SF0RM.pdf" title="Kinetis KE1xF Sub-Family Reference Manual"/>
          <book name="Documents/KE1xFP100M168SF0.pdf"   title="Kinetis KE1xF Sub-Family Data Sheet"/>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="KE02Z2 CMSIS">
      <description>NXP Kinetis KE02 20MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKE02Z16xxx2"/>
      <accept Dname="MKE02Z32xxx2"/>
      <accept Dname="MKE02Z64xxx2"/>
    </condition>

    <condition id="KE02Z4 CMSIS">
      <description>NXP Kinetis KE02 40MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKE02Z16xxx4"/>
      <accept Dname="MKE02Z32xxx4"/>
      <accept Dname="MKE02Z64xxx4"/>
    </condition>

    <condition id="KE04Z4 CMSIS">
      <description>NXP Kinetis KE04 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKE04Z8xxx4"/>
      </condition>

    <condition id="KE04Z1284 CMSIS">
      <description>NXP Kinetis KE04 64kB/128kB 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKE04Z64xxx4"/>
      <accept Dname="MKE04Z128xxx4"/>
    </condition>

    <condition id="KE06Z4 CMSIS">
      <description>NXP Kinetis KE06 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKE06Z64xxx4"/>
      <accept Dname="MKE06Z128xxx4"/>
    </condition>

    <condition id="KE14Z7 CMSIS">
      <description>NXP Kinetis KE14 72MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKE14Z128xxx7"/>
      <accept Dname="MKE14Z256xxx7"/>
    </condition>

    <condition id="KE15Z7 CMSIS">
      <description>NXP Kinetis KE15 72MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128xxx7"/>
      <accept Dname="MKE15Z256xxx7"/>
    </condition>

    <condition id="KE14F16 CMSIS">
      <description>NXP Kinetis KE14F 160MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKE14F256xxx16"/>
      <accept Dname="MKE14F512xxx16"/>
    </condition>

    <condition id="KE16F16 CMSIS">
      <description>NXP Kinetis KE16F 160MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKE16F256xxx16"/>
      <accept Dname="MKE16F512xxx16"/>
    </condition>

    <condition id="KE18F16 CMSIS">
      <description>NXP Kinetis KE18F 160MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKE18F256xxx16"/>
      <accept Dname="MKE18F512xxx16"/>
    </condition>
