saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_KExx_DFP.1.8.1.pdsc
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="KE18F16 CMSIS">
      <description>Button driver for NXP TWR-KE18F board</description>
        <files>
          <file category="source" name="Boards/NXP/TWR-KE18F/Common/Buttons_TWR-KE18F.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="KE18F16 CMSIS">
      <description>LED driver for NXP TWR-KE18F board</description>
        <files>
          <file category="source" name="Boards/NXP/TWR-KE18F/Common/LED_TWR-KE18F.c"/>
        </files>
      </component>
    </bundle>

  </components>

  <boards>
    <board name="TWR-KE18F" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKE18F512xxx16"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KExx Series" DsubFamily="KE1xF"/>
      <description>The TWR-KE18F is a development board for the Kinetis KE1xF 32-bit MCUs.</description>
      <image small="Boards/NXP/TWR-KE18F/Images/TWRKE18F_small.png" large="Boards/NXP/TWR-KE18F/Images/TWRKE18F_large.png"/>
      <book category="overview"  name="http://www.nxp.com/products/microcontrollers-and-processors/arm-processors/kinetis-cortex-m-mcus/e-series-5v-robust-m0-plus-m4/kinetis-ke18-mcu-tower-system-module:TWR-KE18F" title="TWR-KE18F Web Page"/>
      <book category="manual"    name="Boards/NXP/TWR-KE18F/Documents/TWRKE18FUG.pdf"   title="TWR-KE18F User’s Guide"/>
      <book category="setup"     name="Boards/NXP/TWR-KE18F/Documents/TWRKE18FQSG.pdf"  title="TWR-KE18F Quick Start Guide"/>
      <book category="schematic" name="Boards/NXP/TWR-KE18F/Documents/spf-29160_a3.pdf" title="TWR-KE18F Schematics"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="3"              name="Two mechanical push buttons and one reset button"/>
      <feature type="LED"            n="5"              name="Four user-controlled LEDs and one RGB LED"/>
      <feature type="Accelerometer"  n="1"              name="FXOS8700CQ 3D accelerometer + 3D magnetometer"/>
      <feature type="Poti"           n="1"/>
      <feature type="TempSens"       n="1"              name="On-board thermistor"/>
      <feature type="CAN"            n="1"              name="CAN transceiver"/>
      <feature type="ConnOther"      n="1"              name="Flex I/O header"/>
      <feature type="IrDA"           n="1"              name="IrDA transmitter and receiver"/>
      <feature type="TowerFF"        n="1"/>
      <debugInterface adapter="JTAG/SW" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
      <debugInterface adapter="OpenSDA" connector="Micro-USB"/>
    </board>

    <board name="FRDM-KE04Z" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKE04Z8xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KExx Series" DsubFamily="KE04"/>
      <description>The FRDM-KE04Z is an ultra-low-cost development platform for Kinetis KE04 MCUs.</description>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/freedom-development-boards/freescale-freedom-development-platform-for-kinetis-ke04-mcus:FRDM-KE04Z" title="FRDM-KE04Z Web Page"/>
      <book category="manual"    name="Boards/NXP/FRDM-KE04Z/Documents/FRDM-KE04ZUG.pdf" title="Freedom KE04 User’s Guide"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="1"              name="Reset Button"/>
      <feature type="LED"            n="1"              name="Tri-color LED"/>
      <feature type="Accelerometer"  n="1"              name="MMA8451Q Accelerometer"/>
      <feature type="ContOther"      n="1"              name="Capacitive touch slider"/>
      <feature type="IrDA"           n="1"              name="IrDA transmitter and receiver"/>
    </board>

    <board name="FRDM-KE06Z" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKE06Z128xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KExx Series" DsubFamily="KE06"/>
      <description>The FRDM-KE06Z is a simple, yet sophisticated development platform for Kinetis KE06 MCUs.</description>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/freedom-development-boards/freedom-development-platform-for-kinetis-ke06-mcus:FRDM-KE06Z" title="FRDM-KE06Z Web Page"/>
      <book category="manual"    name="Boards/NXP/FRDM-KE06Z/Documents/FRDMKE06UG.pdf" title="Freedom KE06 User’s Guide"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="1"              name="Reset Button"/>
      <feature type="LED"            n="1"              name="Tri-color LED"/>
      <feature type="Accelerometer"  n="1"              name="MMA8451Q Accelerometer"/>
      <feature type="CAN"            n="1"              name="CAN communication"/>
      <feature type="IrDA"           n="1"              name="IrDA transmitter and receiver"/>
    </board>
  </boards>

  <examples>
    <!-- FRDM-KE04Z Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/NXP/FRDM-KE04Z/Blinky">
      <description>Blinky example</description>
      <board name="FRDM-KE04Z" vendor="NXP" Dvendor="NXP:11" Dname="MKE04Z8xxx4"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- FRDM-KE06Z Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/NXP/FRDM-KE06Z/Blinky">
      <description>Blinky example</description>
      <board name="FRDM-KE06Z" vendor="NXP" Dvendor="NXP:11" Dname="MKE06Z128xxx4"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/FRDM-KE06Z/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KE06Z" vendor="NXP" Dvendor="NXP:11" Dname="MKE06Z128xxx4"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-KE18F Tower Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-KE18F/RTX5_Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="TWR-KE18F" vendor="NXP" Dvendor="NXP:11" Dname="MKE18F512xxx16"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
